---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.TreadNosingPosition.FrontOnly
enum: Autodesk.Revit.DB.Architecture.TreadNosingPosition
source: html/4eabcfcb-1df9-3eec-d78e-5306b3f712e2.htm
---
# Autodesk.Revit.DB.Architecture.TreadNosingPosition.FrontOnly

Adds nosing on the front edge of tread only.